results/factorial-final/security-overhead-final-plaintext-broker3/security-overhead-final-factorial-plaintext-b3-rf3-isr3-msg10240-tps1000-batch131072-acks1-prod6-complz4-trial2/producer-perf-6.log
producer_index=6
producer_count=6
producer_records=16666
producer_throughput=166
828 records sent, 165.5 records/sec (1.62 MB/sec), 147.8 ms avg latency, 3656.0 ms max latency.
834 records sent, 166.7 records/sec (1.63 MB/sec), 12.8 ms avg latency, 45.0 ms max latency.
831 records sent, 166.1 records/sec (1.62 MB/sec), 8.1 ms avg latency, 24.0 ms max latency.
831 records sent, 166.2 records/sec (1.62 MB/sec), 8.8 ms avg latency, 29.0 ms max latency.
831 records sent, 166.2 records/sec (1.62 MB/sec), 8.2 ms avg latency, 23.0 ms max latency.
830 records sent, 165.9 records/sec (1.62 MB/sec), 8.6 ms avg latency, 20.0 ms max latency.
832 records sent, 166.2 records/sec (1.62 MB/sec), 8.5 ms avg latency, 28.0 ms max latency.
831 records sent, 166.0 records/sec (1.62 MB/sec), 7.9 ms avg latency, 26.0 ms max latency.
830 records sent, 166.0 records/sec (1.62 MB/sec), 6.9 ms avg latency, 14.0 ms max latency.
832 records sent, 166.2 records/sec (1.62 MB/sec), 7.4 ms avg latency, 66.0 ms max latency.
831 records sent, 166.2 records/sec (1.62 MB/sec), 6.8 ms avg latency, 20.0 ms max latency.
831 records sent, 166.0 records/sec (1.62 MB/sec), 7.0 ms avg latency, 45.0 ms max latency.
830 records sent, 165.9 records/sec (1.62 MB/sec), 6.7 ms avg latency, 32.0 ms max latency.
832 records sent, 166.2 records/sec (1.62 MB/sec), 6.8 ms avg latency, 29.0 ms max latency.
831 records sent, 166.1 records/sec (1.62 MB/sec), 7.3 ms avg latency, 64.0 ms max latency.
830 records sent, 166.0 records/sec (1.62 MB/sec), 6.6 ms avg latency, 28.0 ms max latency.
830 records sent, 165.9 records/sec (1.62 MB/sec), 6.4 ms avg latency, 22.0 ms max latency.
832 records sent, 166.1 records/sec (1.62 MB/sec), 6.6 ms avg latency, 24.0 ms max latency.
831 records sent, 166.0 records/sec (1.62 MB/sec), 6.5 ms avg latency, 16.0 ms max latency.
831 records sent, 166.1 records/sec (1.62 MB/sec), 6.5 ms avg latency, 28.0 ms max latency.
16666 records sent, 165.915041 records/sec (1.62 MB/sec), 14.56 ms avg latency, 3656.00 ms max latency, 7 ms 50th, 32 ms 95th, 201 ms 99th, 286 ms 99.9th.